"""
Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""

def check():
    slist = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
    slist = [slist[i+1]  for i in range(len(slist)-1) if slist[i+1] > slist[i]]
    print(slist)
    return slist # снова мне не яскно как представить результат. принтом или чтобы функция вернула. потому два варианта

if __name__ == '__main__':
    check()